backend/controllers/CuentaController.php

    public function loadHuesped($id_huesped)
    {
        if (($model = Huesped::findOne($id_huesped)) !== null) {
---
SELECT * FROM `huesped` WHERE `id`='1'