backend/controllers/EstanciaController.php

SELECT * FROM `estancia` WHERE `id`='3'
---
    protected function findModel($id)
    {
        if (($model = Estancia::findOne($id)) !== null) {