backend/controllers/HabitacionController.php

    protected function findModel($id)
    {
        if (($model = Habitacion::findOne($id)) !== null) {
---
SELECT * FROM `habitacion` WHERE `id`='17'