backend/controllers/HuespedController.php

    protected function findModel($id)
    {
        if (($model = Huesped::findOne($id)) !== null) {
---
SELECT * FROM `huesped` WHERE `id`='2'