backend/controllers/LimpiezaController.php

SELECT * FROM `limpieza` WHERE `id`='1'
---
    protected function findModel($id)
    {
        if (($model = Limpieza::findOne($id)) !== null) {