backend/controllers/PerfilController.php

INSERT INTO `perfil` (`nombre`, `apellidos`, `telefono`, `sexo`, `id_user`) VALUES ('Jose Eduin', 'Nahuat Noh', '9988971095', 'Macho Alfa Lomo Plateado', 9)
---
    public function actionCreate()
    {
        $model = new Perfil();

        if ($this->request->isPost) {
            if ($model->load($this->request->post()) && $model->save()) {

SELECT * FROM `perfil` WHERE `id`='2'
---
    protected function findModel($id)
    {
        if (($model = Perfil::findOne($id)) !== null) {