backend/controllers/TipoHabitacionController.php

SELECT * FROM `tipo_habitacion` WHERE `id`='1'
---
    protected function findModel($id)
    {
        if (($model = TipoHabitacion::findOne($id)) !== null) {